tutorials/multiphase/cavitatingFoam/les/throttle3D/system/refineMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      refineMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

set             c0;

coordinateSystem global;

globalCoeffs
{
    tan1            ( 1 0 0 );
    tan2            ( 0 1 0 );
    tan3            ( 0 0 1 );
}

directions      ( tan1 tan2 tan3 );

useHexTopology  yes;

geometricCut    no;

writeMesh       no;


// ************************************************************************* //
